/* 빌트인 */
// 값 타입, 연산자, 오브젝트를 JS코드를 처리하는 영역 안에 사전에 만들어 놓은 것
// 사전 처리를 하지 않고 즉시 사용 -> 자바스크립트의 특징

/* 빌트인 */
// 빌트인 값 타입 : Undefinded, Null, Boolean, Number, String, Object\
// 빌트인 연산자 : +, -, *, /, %, ++, --, new 등
/* 빌트인 오브젝트
1. 빌트인 Number 오브젝트 : 123과 같은 숫자, 상수, 지수를 처리하는 오브젝트
  여기서 오브젝트는 소문자 object
  * Object: 키:벨류로 데이터를 저장하는데 중점. object : 데이터를 처리하는 데 중점. 함수가 있음
*/  

/* 빌트인 오브젝트 유형
1. Number 오브젝트 : 123과 같은 숫자, 상수, 지수
2. String 오브젝트 : "abc"와 같은 문자열, 분리, 연결
3. Boolean 오브젝트 : true, false
4. Object 오브젝트 : {key:value} 형태
5. Array 오브젝트 : [1,2,"a","가나다"] 형태
6. Function 오브젝트 : function abc(){} 형태
7. Math 오브젝트 : abs(), round() 등의 수학 계산
8. Date 오브젝트 : 연월일, 시분초
9. Json 오브젝트 : [{"name":"value"}]형태, 서버와 데이터 송수신에 사용
10. RegExp 오브젝트 : ^, $와 같은 정규 표현식
11. 글로벌(global) 오브젝트 : 소스파일 전체에서 하나만 존재, 모든 코드에서 공유, 접근 가능, 전역 객체라고도 하며 뉘앙스에 차이가 있다.
*/